* emacs completion frameworks
#+BEGIN_SRC emacs-lisp
(defun dw/minibuffer-backward-kill (arg)
  "When minibuffer is completing a file name delete up to parent
                  folder, otherwise delete a word"
  (interactive "p")
  (if minibuffer-completing-file-name
      ;; Borrowed from/modified https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
      (if (string-match-p "./" (minibuffer-contents))
          (progn
            (zap-up-to-char (- arg) ?/)
            (pop kill-ring))
        (delete-minibuffer-contents))
    (delete-backward-char arg)))

(use-package vertico
  ;;:elpaca t
  :defer 1
  :ensure t
  :bind (:map minibuffer-local-map
              ("DEL" . dw/minibuffer-backward-kill)
              :map vertico-map
              ("C-'" . vertico-quick-jump))
  ;;:hook ((find-file . vertico-mode))
  :commands (find-file switch-to-buffer)
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode)
  :config
  (setq vertico-quick1 "neiorst")
  (setq vertico-quick2 "neio")
  (defvar vertico-repeat-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "n") #'vertico-next)
      (define-key map (kbd "p") #'vertico-previous)
      (define-key map (kbd "SPC") #'vertico-insert)

      map))
  (dolist (cmd '(vertico-next vertico-previous))
    (put cmd 'repeat-map 'vertico-repeat-map)))

(use-package orderless
  ;;:elpaca t
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(defun dw/get-project-root ()
  (when (fboundp 'projectile-project-root)
    (projectile-project-root)))

(setq completion-ignore-case  t)

(setq read-file-name-completion-ignore-case t
      read-buffer-completion-ignore-case t
      completion-ignore-case t)

(use-package marginalia
  ;;:elpaca t
  :after (vertico)
  :ensure t
  :config
  (marginalia-mode))



(use-package embark
  ;;:elpaca t
  :ensure t
  :bind
  (("C-," . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-c ." . embark-dwim)        ;; good alternative: M-.

   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
  ;;:init

  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  ;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
  ;; strategy, if you want to see the documentation from multiple providers.
  (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  (setq embark-cycle-key (kbd ","))
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  ;;:elpaca t
  :after (embark)
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

#+END_SRC

#+RESULTS:
| consult-preview-at-point-mode | embark-consult--upgrade-markers |

